app/controllers/scores_controller.rb

	def create
		# check first if its an AJAX request
		if request.xhr?
			# hash the passed lines_made with the token in the session
			require "digest"
			hash = Digest::MD5.hexdigest(session[:token] + params[:lines_made])

			# confirm that score is valid, hashes should match
			if hash == params[:hash]

				@score = Score.new(
				:username => params[:username],
				:lines_made => params[:lines_made]
				)

				respond_to do |format|
					if @score.save
---
INSERT INTO `scores` (`created_at`, `updated_at`, `username`, `lines_made`) VALUES('2010-04-16 11:15:18', '2010-04-16 11:15:18', 'hiiii', 4)

	def index
		# get the top 10 All-time
		scores_all = Score.all(:select => "username, lines_made", :limit => 10, :order => "lines_made DESC")
---
SELECT username, lines_made FROM `scores` WHERE (updated_at > FROM_UNIXTIME(1269292529)) ORDER BY lines_made DESC LIMIT 10